export const cities = [
{ name: "Алматы", lat: 43.2220, lon: 76.8512 },
{ name: "Астана", lat: 51.1694, lon: 71.4491 },
{ name: "Шымкент", lat: 42.3000, lon: 69.6000 },
{ name: "Актобе", lat: 50.2839, lon: 57.1670 },
{ name: "Караганда", lat: 49.8047, lon: 73.1094 },
{ name: "Тараз", lat: 42.9000, lon: 71.3667 },
{ name: "Павлодар", lat: 52.2873, lon: 76.9674 },
{ name: "Усть-Каменогорск", lat: 49.9481, lon: 82.6283 },
{ name: "Семей", lat: 50.4111, lon: 80.2275 },
{ name: "Атырау", lat: 47.1164, lon: 51.8826 },
{ name: "Костанай", lat: 53.2144, lon: 63.6246 },
{ name: "Кызылорда", lat: 44.8528, lon: 65.5089 },
{ name: "Актау", lat: 43.6508, lon: 51.1600 },
{ name: "Орал", lat: 51.2333, lon: 51.3667 },
{ name: "Петропавл", lat: 54.8667, lon: 69.1500 },
{ name: "Темиртау", lat: 50.0536, lon: 72.9611 },
{ name: "Туркестан", lat: 43.3000, lon: 68.2500 },
{ name: "Кокшетау", lat: 53.2833, lon: 69.3833 },
{ name: "Талдыкорган", lat: 45.0167, lon: 78.3833 },
{ name: "Экибастуз", lat: 51.7239, lon: 75.3228 },
] as const;

export type City = typeof cities[number];
